Tekla.Structures.Model.RebarPropertyModifier.PropertyModifierFlags
The property modifier flags enum.

Tekla.Structures.Model.RebarPropertyModifier.PropertyModifierFlags.Name
The name flag.

Tekla.Structures.Model.RebarPropertyModifier.PropertyModifierFlags.Class
The class flag.

Tekla.Structures.Model.RebarPropertyModifier.PropertyModifierFlags.Grade
The grade flag.

Tekla.Structures.Model.RebarPropertyModifier.PropertyModifierFlags.Size
The size flag.

Tekla.Structures.Model.RebarPropertyModifier.PropertyModifierFlags.BendingRadius
The bending radius flag.

Tekla.Structures.Model.RebarPropertyModifier.PropertyModifierFlags.Finish
The finish flag.

Tekla.Structures.Model.RebarPropertyModifier.PropertyModifierFlags.Prefix
The prefix flag.

Tekla.Structures.Model.RebarPropertyModifier.PropertyModifierFlags.StartNumber
The start number flag.

Tekla.Structures.Model.RebarPropertyModifier.PropertyModifierFlags.GroupingType
The grouping type flag.